Aightech/monomod/firmware/bringup/lis3dh_test/sdkconfig.defaults
# LIS3DH bring-up test — XIAO ESP32-C3
CONFIG_IDF_TARGET="esp32c3"

# XIAO C3 has no UART bridge: console + flashing go over USB-Serial/JTAG
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
